Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: During execution, the :term:`buildtools` tarball will be downloaded, the checksum of the download will be verified, the installer will be run for you, and some basic checks will be run to make sure the installation is functional.
it_it: Durante l'esecuzione, verrà scaricato il file tarball di :term:`buildtools`, verrà verificato il checksum del download, verrà eseguito il programma di installazione e verranno effettuati alcuni controlli di base per assicurarsi che l'installazione sia funzionante.

source: During feature freeze, a new branch is created and maintained separately to test new features and enhancements received from contributors, but these changes will only make it to the master branch after the release is out.
it_it: Durante il periodo di Feature Freeze, viene creato e gestito separatamente un nuovo branch [ramo] per testare le nuove funzionalità e i miglioramenti ricevuti dai collaboratori, ma queste modifiche verranno integrate nel branch master solo dopo il rilascio della release.

source: During subsequent builds, BitBake checks each recipe (together with, for example, any files included or appended to it) to see if they have been modified. Changes can be detected, for example, through file modification time (mtime) changes and hashing of file contents. If no changes to the file are detected, then the parsed result stored in the cache is reused. If the file has changed, it is reparsed.
it_it: Durante le compilazioni successive, BitBake controlla ogni ricetta (insieme, ad esempio, a tutti i file inclusi o aggiunti ad essa) per verificare se sono state modificate. Le modifiche possono essere rilevate, ad esempio, tramite le variazioni dell'ora di modifica (mtime) del file e l'hashing del contenuto del file. Se non vengono rilevate modifiche al file, il risultato dell'analisi memorizzato nella cache viene riutilizzato. Se il file è stato modificato, viene rianalizzato.

source: During this six-months period of time, the Yocto Project releases four "Milestone" releases which represent distinct points of time. The milestone releases are tested through the :ref:`ref-manual/release-process:Testing and Quality Assurance` process and helps spotting issues before the actual release is out.
it_it: Durante questo periodo di sei mesi, Yocto Project rilascia quattro release "Milestone" che rappresentano punti di riferimento distinti. Le release milestone vengono testate attraverso il processo :ref:`ref-manual/release-process:Testing and Quality Assurance`, che aiuta a individuare i problemi prima del rilascio effettivo.

source: Dynamic tracepoints are implemented under the covers by Kprobes and Uprobes. Kprobes and Uprobes are also used by and in fact are the main focus of SystemTap.
it_it: I punti di traccia dinamici sono implementati internamente da Kprobes e Uprobes. Kprobes e Uprobes sono utilizzati anche da SystemTap e ne costituiscono l'obiettivo principale.

source: Each event handler function in the generated code is modified to do this. For convenience, we define a common function called ``inc_counts()`` that each handler calls; ``inc_counts()`` just tallies a count for each event using the ``counts`` hash, which is a specialized hash function that does Perl-like autovivification, a capability that's extremely useful for kinds of multi-level aggregation commonly used in processing traces (see perf's documentation on the Python language binding for details):
it_it: Ogni funzione di gestione degli eventi nel codice generato viene modificata per fare ciò. Per comodità, definiamo una funzione comune chiamata ``inc_counts()`` che viene richiamata da ogni gestore; ``inc_counts()`` si limita a contare ogni evento utilizzando l'hash ``counts``, una funzione hash specializzata che esegue l'autovivificazione in stile Perl, una funzionalità estremamente utile per i tipi di aggregazione multilivello comunemente utilizzati nell'elaborazione delle tracce (vedere la documentazione di perf sul binding per il linguaggio Python per i dettagli):

source: Each item in the ``"package"`` list corresponds to a package installed on the built image. Each of these packages contain a number of CVE entries under the ``"issue"`` sub-list. These CVE can have the following statuses:
it_it: Ogni elemento nell'elenco ``"package"`` corrisponde a un pacchetto installato sull'immagine compilata. Ciascuno di questi pacchetti contiene un certo numero di voci CVE nella sottolista ``"issue"``. Queste CVE possono avere i seguenti stati:

source: Each line in the trace above shows what was happening in the kernel on a given CPU, to the level of detail of function calls. Each entry shows the function called, followed by its caller (after the arrow).
it_it: Ogni riga della traccia sopra riportata mostra cosa stava accadendo nel kernel su una data CPU, con un livello di dettaglio pari a quello delle chiamate di funzione. Ogni voce mostra la funzione chiamata, seguita dal suo chiamante (dopo la freccia).

source: Each major release receives a codename that identifies the release in the :ref:`overview-manual/development-environment:yocto project source repositories`. The concept is that branches of :term:`Metadata` with the same codename are likely to be compatible and thus work together.
it_it: Ogni release major riceve un nome in codice che la identifica nei :ref:`overview-manual/development-environment:yocto project source repositories`. L'idea è che i branche di :term:`Metadata` con lo stesso nome in codice siano probabilmente compatibili e quindi funzionino insieme.

source: Each metadata layer being used should contain a ``README`` file and that should explain where to report issues, where to send changes and how to contact the maintainers.
it_it: Ogni layer di metadati utilizzato dovrebbe contenere un file ``README`` che spiega dove segnalare i problemi, dove inviare le modifiche e come contattare i manutentori.

source: Each of these branches represents a specific area of development. The "master" branch represents the current or most recent development. All other branches represent offshoots of the "master" branch.
it_it: Ciascuno di questi branch rappresenta un'area di sviluppo specifica. Il branch "master" rappresenta lo sviluppo corrente o più recente. Tutti gli altri branch rappresentano derivazioni del branch "master".

source: Each of these packages contains a default list of files defined with the :term:`FILES` variable. For example, the package ``${PN}-dev`` represents files useful to the development of applications depending on ``${PN}``. The default list of files for ``${PN}-dev``, also defined in :oe_git:`bitbake.conf </openembedded-core/tree/meta/conf/bitbake.conf>`, is defined as follows::
it_it: Ciascuno di questi pacchetti contiene un elenco di default di file definiti con la variabile :term:`FILES`. Ad esempio, il pacchetto ``${PN}-dev`` rappresenta i file utili allo sviluppo di applicazioni che dipendono da ``${PN}``. L'elenco di default di file per ``${PN}-dev``, definito anche in :oe_git:`bitbake.conf </openembedded-core/tree/meta/conf/bitbake.conf>`, è definito come segue::

source: Each one of these subdirectories corresponds to a "subsystem" and contains yet again more subdirectories, each one of those finally corresponding to a tracepoint. For example, here are the contents of the ``kmem`` subsystem::
it_it: Ciascuna di queste sottodirectory corrisponde a un "sottosistema" e contiene a sua volta altre sottodirectory, ognuna delle quali corrisponde infine a un tracepoint. Ad esempio, ecco il contenuto del sottosistema ``kmem``::

source: Each recipe has an area in the :term:`Build Directory` where the unpacked source code resides. The :term:`UNPACKDIR` variable points to this area for a recipe's unpacked source code, and has the default ``sources`` name. The preceding figure and the following list describe the :term:`Build Directory`'s hierarchy:
it_it: Ogni ricetta ha un'area nella :term:`Build Directory` in cui risiede il codice sorgente decompresso. La variabile :term:`UNPACKDIR` punta a questa area per il codice sorgente decompresso di una ricetta e ha come nome di default ``sources``. La figura precedente e l'elenco seguente descrivono la gerarchia della :term:`Build Directory`:

source: Each repository is a BSP layer supported by the Yocto Project (e.g. ``meta-raspberrypi`` and ``meta-intel``). Each of these layers is a repository unto itself and clicking on the layer name displays two URLs from which you can clone the layer's repository to your local system. Here is an example that clones the Raspberry Pi BSP layer::
it_it: Ogni repository corrisponde a un layer BSP supportato da Yocto Project (ad esempio, ``meta-raspberrypi`` e ``meta-intel``). Ciascuno di questi layer è un repository a sé stante e cliccando sul nome del layer vengono visualizzati due URL da cui è possibile clonare il repository del layer sul proprio sistema locale. Ecco un esempio che clona il layer BSP Raspberry Pi::

source: Edit the `DATABASES <https://docs.djangoproject.com/en/2.2/ref/settings/#databases>`__ settings:
it_it: Modificare le impostazioni di `DATABASES <https://docs.djangoproject.com/en/2.2/ref/settings/#databases>`__:

source: Edit the `SECRET_KEY <https://docs.djangoproject.com/en/2.2/ref/settings/#std:setting-SECRET_KEY>`__:
it_it: Modifica le impostazioni di `SECRET_KEY <https://docs.djangoproject.com/en/2.2/ref/settings/#std:setting-SECRET_KEY>`__:

source: Edit the `STATIC_ROOT <https://docs.djangoproject.com/en/2.2/ref/settings/#std:setting-STATIC_ROOT>`__:
it_it: Modifica le impostazioni di`STATIC_ROOT <https://docs.djangoproject.com/en/2.2/ref/settings/#std:setting-STATIC_ROOT>`__:

source: Edit the ``init-ifupdown_1.0.bbappend`` file so that it contains the following::
it_it: Modificare il file ``init-ifupdown_1.0.bbappend`` in modo che contenga quanto segue::

source: Enable hardware support for secure boot functionality when your device supports this functionality.
it_it: Abilitare il supporto hardware per la funzionalità di avvio protetto (Secure Boot) se il dispositivo la supporta.

source: Enable the events you want to trace (in this case all kernel events)::
it_it: Abilitare gli eventi da tracciare (in questo caso tutti gli eventi del kernel)::

source: Enable the events you want to trace (in this case all user space events)::
it_it: Abilitare gli eventi da tracciare (in questo caso tutti gli eventi nello spazio utente):

source: Enabling Shared State Signing
it_it: Abilitazione della Firma dello Shared State

source: Ensure that the following utilities have these minimum version numbers:
it_it: Assicurarsi che le seguenti utility abbiano i seguenti numeri di versione minimi:

source: Ensure you can update the software on the device to mitigate vulnerabilities discovered in the future. This consideration especially applies when your device is network-enabled.
it_it: Si deve poter aggiornare il software sul dispositivo per mitigare le vulnerabilità che potrebbero essere scoperte in futuro. Questa considerazione è particolarmente importante quando il dispositivo è connesso alla rete.

source: Ensure you have no network services listening that are not needed.
it_it: Non ci devono essere in ascolto servizi di rete non necessari.

source: Ensure you remove or disable debugging functionality before producing the final image. For information on how to do this, see the ":ref:`security-manual/securing-images:considerations specific to the openembedded build system`" section.
it_it: Rimuovere o disabilitare la funzionalità di debug prima di generare l'immagine finale. Per informazioni su come procedere, consultare la sezione ":ref:`security-manual/securing-images:considerations specific to the openembedded build system`".

source: Ensure your directory structure in the BSP layer that supports your machine is such that the OpenEmbedded build system can find it. See the example later in this section for more information.
it_it: Assicurarsi che la struttura delle directory nel layer BSP che supporta la macchina sia tale da consentire al sistema di build OpenEmbedded di trovarla. Per ulteriori informazioni, consultare l'esempio riportato più avanti in questa sezione.

source: Equally, there are cases where you need to add dependencies BitBake is not able to find. You can accomplish this by using a line like the following::
it_it: Analogamente, ci sono casi in cui è necessario aggiungere dipendenze che BitBake non è in grado di trovare. È possibile farlo utilizzando una riga come la seguente::

source: Establishing Toaster System Dependencies
it_it: Impostazione delle Dipendenze di Sistema di Toaster

source: Eventually all the special-purpose tracers currently available in ``/sys/kernel/debug/tracing`` will be removed and replaced with equivalent tracers based on the "trace events" subsystem.
it_it: Alla fine, tutti i tracer specifici attualmente disponibili in ``/sys/kernel/debug/tracing`` verranno rimossi e sostituiti con tracer equivalenti basati sul sottosistema degli "trace events" [eventi di tracciamento].

source: Examine error, warning and trace messages to aid in debugging.
it_it: Esaminare i messaggi di errore, warning e trace [traccia] per facilitare il debug.

source: Examine error, warning, and trace messages to aid in debugging.
it_it: Esaminare i messaggi di errore, warning e trace [traccia] per facilitare il debug.

source: Example Filesystem Layout
it_it: Esempio di Struttura del Filesystem

source: Example of output for a CVE not in range:
it_it: Esempio di output per una CVE non inclusa nell'intervallo:

source: Example of output for a CVE rejected by the Linux CNA:
it_it: Esempio di output per una CVE rifiutata da Linux CNA:

source: Example of output for a CVE that is vulnerable:
it_it: Esempio di output per una CVE vulnerabile:

source: Example output for a CVE for which the status was changed to "Ignored" because the source files associated to the CVE were not compiled:
it_it: Esempio di output per una CVE il cui stato è stato modificato in "Ignored" perché i file sorgente associati alla CVE non sono stati compilati:perché i file sorgente associati alla CVE non sono stati compilati:

source: Example using ``--debug-sources`` file instead of SPDX kernel file:
it_it: Esempio con il file ``--debug-sources`` al posto del file del kernel SPDX:

source: Example using ``--old-cve-report`` as input:
it_it: Esempio con ``--old-cve-report`` come input:

source: Example using the ``--kernel-version``:
it_it: Esempio con ``--kernel-version``:

source: Example:
it_it: Esempio

source: Examples
it_it: Esempi

source: Exceptions to these rules must be approved by the TSC.
it_it: Eventuali eccezioni a queste regole devono essere approvate dal TSC.

source: Execute the ``install-buildtools`` script. Here is an example::
it_it: Eseguire lo script ``install-buildtools``. Ecco un esempio::

source: Execute the installation script. Here is an example for the traditional installer::
it_it: Eseguire lo script di installazione. Ecco un esempio per il programma di installazione tradizionale::

source: Execute the workload you're interested in::
it_it: Eseguire il carico di lavoro di interesse::

source: Extension to the Application Binary Interface (ABI) field of the GNU canonical architecture name (e.g. "eabi").
it_it: Estensione al campo Application Binary Interface (ABI) del nome dell'architettura canonica GNU (ad esempio, "eabi").

source: Extra Packages for Enterprise Linux (i.e. ``epel-release``) is a collection of packages from Fedora built on RHEL/CentOS for easy installation of packages not included in enterprise Linux by default. You need to install these packages separately.
it_it: Extra Packages for Enterprise Linux (ovvero ``epel-release``) è una raccolta di pacchetti di Fedora basati su RHEL/CentOS per facilitare l'installazione di pacchetti non inclusi di default in Enterprise Linux. È necessario installare questi pacchetti separatamente.

source: Extract - unpack the sources
it_it: Extract - estrazione dei sorgenti

source: Fakeroot and Pseudo
it_it: Fakeroot e Pseudo

source: Familiarize yourself with the :yocto_home:`Yocto Project Compatible Layers </software-overview/layers/>` or the :oe_layerindex:`OpenEmbedded Layer Index <>`. The latter contains more layers but they are less universally validated.
it_it: Familiarizzare con i :yocto_home:`Yocto Project Compatible Layers </software-overview/layers/>` o con l':oe_layerindex:`OpenEmbedded Layer Index <>`. Quest'ultimo contiene più layer, ma sono meno universalmente validati.

source: Feature
it_it: Funzionalità

source: Features
it_it: Caratteristiche

source: Fedora Packages
it_it: Pacchetti Fedora

source: Fetch - get the source code
it_it: Fetch - recupero del codice sorgente

source: Files that append build information to a recipe file. Append files are known as BitBake append files and ``.bbappend`` files. The OpenEmbedded build system expects every append file to have a corresponding recipe (``.bb``) file. Furthermore, the append file and corresponding recipe file must use the same root filename. The filenames can differ only in the file type suffix used (e.g. ``formfactor_0.0.bb`` and ``formfactor_0.0.bbappend``).
it_it: File che aggiungono informazioni di build a un file di ricetta. I file append sono noti come file append di BitBake e file ``.bbappend``. Il sistema di build OpenEmbedded prevede che ogni file append abbia un file di ricetta (``.bb``) corrispondente. Inoltre, il file append e il file ricetta corrispondente devono utilizzare lo stesso nome file radice. I nomi dei file possono differire solo per il suffisso del tipo di file utilizzato (ad esempio, ``formfactor_0.0.bb`` e ``formfactor_0.0.bbappend``).

source: Files that have the ``.bb`` suffix are "recipes" files. In general, a recipe contains information about a single piece of software. This information includes the location from which to download the unaltered source, any source patches to be applied to that source (if needed), which special configuration options to apply, how to compile the source files, and how to package the compiled output.
it_it: I file con estensione ``.bb`` sono "ricette". In generale, una ricetta contiene informazioni su un singolo software. Queste informazioni includono la posizione da cui scaricare il codice sorgente non modificato, eventuali patch da applicare al codice sorgente (se necessario), le opzioni di configurazione speciali da applicare, le modalità di compilazione dei file sorgente e le modalità di creazione del pacchetto dell'output compilato.

source: Files that hold global definitions of variables, user-defined variables, and hardware configuration information. These files tell the OpenEmbedded build system what to build and what to put into the image to support a particular platform.
it_it: File che contengono definizioni globali di variabili, variabili definite dall'utente e informazioni sulla configurazione hardware. Questi file indicano al sistema di build di OpenEmbedded cosa compilare e cosa includere nell'immagine per supportare una particolare piattaforma.

source: Files that provide for logic encapsulation and inheritance so that commonly used patterns can be defined once and then easily used in multiple recipes. For reference information on the Yocto Project classes, see the ":ref:`ref-manual/classes:Classes`" chapter. Class files end with the ``.bbclass`` filename extension.
it_it: File che forniscono incapsulamento logico ed ereditarietà, in modo che i pattern di uso comune possano essere definiti una sola volta e poi facilmente utilizzati in più ricette. Per informazioni di riferimento sulle classi di Yocto Project , consultare il capitolo ":ref:`ref-manual/classes:Classes`". I file delle classi terminano con l'estensione ``.bbclass``.

source: Filtering
it_it: Filtraggio

source: Finally, at the end of the trace processing run, we want to print the result of all the per-event tallies. For that, we use the special ``trace_end()`` function:
it_it: Infine, al termine dell'esecuzione dell'elaborazione della traccia, vogliamo stampare il risultato di tutti i conteggi per evento. A tale scopo, utilizziamo la funzione speciale ``trace_end()``:

source: Finally, here are the distribution versions which were previously tested on former revisions of "Blacksail", but no longer are:
it_it: Infine, ecco le versioni di distribuzione che in precedenza venivano testate sulle revisioni precedenti di "Blacksail", ma che ora non lo sono più:

source: Finally, if the file referenced has not been renamed, the alternatives system will rename it to avoid the need to rename alternative files in the :ref:`ref-tasks-install` task while retaining support for the command if necessary.
it_it: Infine, se il file a cui si fa riferimento non è stato rinominato, il sistema di alternative lo rinominerà per evitare di dover rinominare i file alternativi nel task :ref:`ref-tasks-install`, mantenendo comunque il supporto per il comando, se necessario.

source: Finally, in addition to the Autobuilder's tests, the Yocto Project QA team also performs testing on a variety of platforms, which includes actual hardware, to ensure expected results.
it_it: Infine, oltre ai test di Autobuilder, il team di controllo qualità di Yocto Project esegue test anche su diverse piattaforme, incluso hardware reale, per garantire i risultati attesi.

source: Finally, looking at the third Sysprof pane in the lower left, we can see a list of all the callers of a particular function selected in the top left pane. In this case, the lower pane is showing all the callers of ``__mark_inode_dirty``:
it_it: Infine, osservando il terzo riquadro di Sysprof in basso a sinistra, possiamo vedere un elenco di tutti i chiamanti di una particolare funzione selezionata nel riquadro in alto a sinistra. In questo caso, il riquadro inferiore mostra tutti i chiamanti di ``__mark_inode_dirty``:

source: Finally, note that ``patchtest`` is designed to test patches in a standalone way, so if your patches are meant to apply on top of changes made by previous patches in a series, it is possible that ``patchtest`` will report false failures regarding the "merge on head" test.
it_it: Infine, si tenga presente che ``patchtest`` è progettato per testare le patch in modo indipendente, quindi se le patch devono essere applicate sopra le modifiche apportate da patch precedenti in una serie, è possibile che ``patchtest`` segnali falsi errori relativi al test "merge on head".

source: Finally, restart Apache to make sure all new configuration is loaded. For Ubuntu, Debian, and openSUSE use::
it_it: Infine, riavviare Apache per assicurarsi che tutta la nuova configurazione sia stata caricata. Per Ubuntu, Debian e openSUSE usare::

source: Finally, run the script by using one of the examples below. The most exact are the first two examples, using the old cve-summary.json.
it_it: Infine, eseguire lo script utilizzando uno degli esempi seguenti. I primi due esempi sono i più precisi e utilizzano il vecchio file cve-summary.json.

source: Finally, store either the ``recipe-linux-yocto.spdx.json`` or the ``linux-yocto-debugsources.json.zstd`` outside the :term:`build directory`.
it_it: Infine, salvare il file ``recipe-linux-yocto.spdx.json`` o il file ``linux-yocto-debugsources.json.zstd`` al di fuori della :term:`build directory`.

source: Finally, the ``collectstatic`` command is a Django framework command that collects all the statically served files into a designated directory to be served up by the Apache web server as defined by ``STATIC_ROOT``.
it_it: Infine, il comando ``collectstatic`` è un comando del framework Django che raccoglie tutti i file serviti staticamente in una directory designata per essere serviti dal server web Apache, come definito da ``STATIC_ROOT``.
